Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: མ་ལ་བདག་གིས་ཀྱང་དགེ་བའི་རྩ་བའི་ཆོས་ཅུང་ཟད་ཙམ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་བྱ་གོར་མ་ཆག །འོན་ཀྱང་དེས་དབུལ་བ་ཆད་པར་འགྱུར་རོ་
en: I will make sure to take up just a fraction of his virtuous qualities and maintain it, and my poverty will come to an end.’

source: སྙམ་དུ་དེ་ལྟ་བུའི་སེམས་སྐྱེས་སོ། །
en: Such were the thoughts he had.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་མི་འབྱུང་བའི་ཚེ་རང་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་སྟེ།
en: “Now in times when a blessed one has not arisen in the world, the solitary buddhas appear.

source: རང་སངས་རྒྱས་ཞིག་དེའི་ཁྱིམ་སྒོར་འོངས་སོ། །
en: So it was that a solitary buddha came to his door.

source: དེ་ནས་བྲམ་ཟེ་དབུལ་པོ་དེས་ཐག་རིང་པོ་ཞིག་ནས་རང་སངས་རྒྱས་དེ་མཐོང་ངོ་། །
en: When the poor brahmin saw the solitary buddha from a distance,

source: མཐོང་ནས་ཀྱང་དེ་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་སོ། །
en: he felt a surge of joy toward him.

source: དགའ་བ་སྐྱེས་ནས་བྲམ་ཟེ་དེས་རང་སངས་རྒྱས་དེ་ལ་བསོད་སྙོམས་ཕུལ་ལོ། །
en: In his joy the brahmin offered alms to the solitary buddha.

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་ལུས་ཀྱིས་ཆོས་སྟོན་པར་བྱེད་ཀྱི་ངག་གིས་མ་ཡིན་ཏེ། དེས་བསོད་སྙོམས་དེ་བླངས་ནས་དེ་ཁོ་ན་ནས་ནམ་མཁའ་ལ་སོང་ངོ་། །
en: “Those great beings do not teach the Dharma with words but through their actions, so the sage accepted the alms and rose into the sky.

source: དེ་ནས་བྲམ་ཟེ་དེ་ལྷག་པར་ཡང་དགའ་བ་སྐྱེས་ནས་རྐང་པ་ལ་དམིགས་ཏེ་ཕྱག་འཚལ་ནས་སྨོན་ལམ་བཏབ་པ།
en: This caused the brahmin particular delight, and, bowing down at his feet, he prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘Oh, by this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: བདག་གིས་ཀྱང་རྒྱལ་པོ་ལ་བརྟེན་ཅིང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་ནོར་ལེན་པ་དང་།
en: May I, on behalf of the king, accept money from the brahmins and householders,

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བརྟེན་ཅིང་རྒྱལ་པོའི་ནོར་ལེན་པ་དང་འདི་བས་ཀྱང་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: and on behalf of the brahmins and householders, accept money from the king. May I please and not displease a teacher even more exalted than this.’

source: དེའི་ཚེ་བྲམ་ཟེ་དབུལ་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་འཛིན་བྱེད་ཀྱི་བུ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that poor brahmin then is none other than Son of Grasping.

source: དེས་རང་སངས་རྒྱས་དེ་ལ་བསོད་སྙོམས་ཕུལ་ནས་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པ་དེས་ན་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: The act of offering alms to a solitary buddha and saying that prayer ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth,

source: དེས་དེར་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བརྟེན་ཅིང་རྒྱལ་པོའི་ནོར་ལེན་པར་བྱེད། རྒྱལ་པོ་ལ་བརྟེན་ཅིང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་ནོར་ལེན་པར་བྱེད་ལ།
en: and that he accepted money from the brahmin householders on behalf of the king, and accepted money from the king on behalf of the brahmins and householders.

source: དགེ་སློང་དག་ང་རང་སངས་རྒྱས་བྱེ་བ་ཕྲག་འབུམ་བས་ཀྱང་ཆེས་ལྷག་པར་ཁྱད་པར་དུ་འཕགས་པ་ང་ལྟ་བུ་འདིས་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ། །
en: “Monks, I am more exalted than even one hundred billion solitary buddhas, and now he has pleased me and not displeased me.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དགེ་བསྙེན་དུ་གྱུར་ཏེ། དེས་དེར་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “He also became a lay vow holder in the doctrine of the totally and completely awakened Buddha Kāśyapa and went for refuge and maintained the fundamental precepts all his life. Then, at the time of his death, he prayed,

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དགེ་བསྙེན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་འཛིན་བྱེད་ཀྱི་བུ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: “O monks, what do you think? The one who was that lay vow holder then is none other than Son of Grasping.

source: དེས་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time he went for refuge and maintained the fundamental precepts all his life, and at the time of his death, he prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཡིན་པ་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: ‘May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས་འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that he has pleased me and not displeased me.”

source: རབ་བཟང་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Among the gods of the Heaven of the Thirty-Three, in the retinue of Śakra, king of the gods, there was a certain gandharva king named Supriya.

source: དེས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དགའ་བར་བྱ་བའི་ཕྱིར་དེ་དང་འབྲེལ་བའི་གླུ་དབྱངས་སྦྱོར་བ་ལ་ཞུགས་སོ། །
en: Supriya would sing songs about Śakra, king of the gods, much to Śakra’s delight.

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ལས་རྣམ་པ་བཞིའི་གཟིགས་པས་འཇིག་རྟེན་ལ་གཟིགས་ནས་ཡུམ་གྱི་ལྷུམས་སུ་གཤེགས་པ་དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་ལ་སྨྲས་པ།
en: Now when the Bodhisattva, having looked out upon the world and made the four observations from his place in Tuṣita Heaven, entered his mother’s womb, at that time Śakra, king of the gods, said to the gandharva king Supriya,

source: རབ་དགའ་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་རིས་དགའ་ལྡན་ནས་ཤི་འཕོས་ཏེ། ཡུམ་གྱི་ལྷུམས་སུ་ཉིང་མཚམས་སྦྱར་ནས་གང་གི་ཚེ་དེ་བལྟམས་ཏེ།
en: “Supriya, a certain bodhisattva has passed away from Tuṣita Heaven, transmigrated, and reincarnated in his mother’s womb.

source: ཆེར་སྐྱེས་པ་དེའི་ཚེ་བདུད་རྩི་བརྙེས་ནས་དེས་འགྲོ་བ་རྣམས་ཚིམ་པར་མཛད་པར་འགྱུར་གྱིས།
en: After he is born and has grown, he will gain the nectar of immortality and satiate living beings.

source: ཁྱོད་ཀྱིས་ཀྱང་འཛམ་བུའི་གླིང་དུ་ཉིང་མཚམས་སྦྱོར་ཅིག་དང་། ཁྱོད་ལ་ཡང་དེས་བདུད་རྩིའི་སྐལ་བ་སྦྱིན་པར་འགྱུར་རོ། །
en: You should also take birth in Jambudvīpa so that he might also grant you a share of the nectar of immortality.”

source: རབ་དགས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བདག་གིས་གླུ་དབྱངས་སྦྱར་བ་བརྩམས་ལགས་ཏེ། རེ་ཞིག་དེ་ལགས་པར་བགྱིས་ན་སླད་ཀྱིས་སླེབས་སོ་ཞེས་ཟེར་རོ། །
en: “Kauśika,” Supriya told him, “I have just begun composing a song, but once it is finished, I shall go.”

source: དེ་ནས་དེའི་ཚེ་གྲོང་ཁྱེར་ཀུ་ཤི་ན་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན་གྲོང་ཁྱེར་ཀུ་ཤི་ན་གནས་པའི་གྱད་ཀྱི་བུ་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་བྱེད།
en: At that time in the city of Kuśinagarī, all the young athletes of Kuśinagarī held in high esteem a mendicant named Subhadra, a person of miracles.

source: བླ་མར་བྱེད། རི་མོར་བྱེད། མཆོད་པར་བྱེད་ཅིང་དགྲ་བཅོམ་པར་བཀུར་བ་ཞིག་ཡོད་དེ།
en: They revered, honored, venerated, and admired him.

source: དེ་མཚོ་མ་དྲོས་པའི་འགྲམ་ན་ཉིན་པར་གནས་སོ། །
en: He spent his days on the banks of Lake Anavatapta,

source: དེར་ཡང་དེ་ལ་ལྷ་དང་ཀླུ་རྣམས་ཀྱིས་བཀུར་སྟི་བྱེད། བླ་མར་བྱེད། རི་མོར་བྱེད་མཆོད་པར་བྱེད་དོ། །
en: and the gods and nāgas there held him in high esteem, accepted him as their guru, and honored and venerated him.

source: དེ་རེས་འགའ་ནི་མཚོ་མ་དྲོས་པའི་འགྲམ་དེ་ཉིད་ན་ཉིན་པར་གནས་ཤིང་འདུག་གོ། །
en: Sometimes he would spend the entire day on the banks of Lake Anavatapta.

source: རེས་འགའ་ནི་མཚོ་མ་དྲོས་པ་དེ་ཉིད་ནས་ཐག་མི་རིང་བ་ཞིག་ན་ཤིང་ཨུ་དུམ་བཱ་རའི་ཚལ་ཞིག་ཡོད་པ་དེར་སོང་ནས་འདུག་གོ། །
en: At other times he went and sat in a forest of udumbara trees, not far from the lake.

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བལྟམ་པ་དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་ལ་སྨྲས་པ།
en: When the Bodhisattva was born, Śakra, King of the Gods, said to the gandharva king Supriya,

source: རབ་དགའ་བྱང་ཆུབ་སེམས་དཔའ་བལྟམ་གྱིས་ཚུར་དང་བདག་ཅག་གིས་དེའི་མཆོད་པའི་ལས་ལ་བརྩོན་པར་བྱའོ། །
en: “Supriya, now that the Bodhisattva has been born, come! Let us make an effort to offer him our adoration.”

source: རབ་དགས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བདག་གིས་གླུ་དབྱངས་སྦྱར་བ་བརྩམས་ལགས་ཏེ། དེ་རེ་ཞིག་དེ་ལགས་པར་བགྱིས་ནས་སླད་ཀྱིས་སླེབས་སོ་ཞེས་ཟེར་རོ། །
en: “Kauśika,” Supriya told him, “I have just begun composing a song, but once it is finished, I shall go.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཆེ་བ་ཉིད་ཀྱིས་ཨུ་དུམ་བཱ་རའི་ཚལ་དེར་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་རྣམས་ཁ་འབུས་པར་གྱུར་ཏོ། །
en: Through the greatness of the Bodhisattva, there in the udumbara forest the udumbara flowers began to bloom.

source: དེ་ནས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་གིས་ཤིང་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ཁ་འབུས་པ་མཐོང་ནས། མཐོང་མ་ཐག་ཏུ་ཡིད་དགའ་བར་གྱུར་ཏེ་
en: The mendicant Subhadra saw that the udumbara flowers were blooming and was thrilled at the sight.

source: དེས་བསམས་པ། ག་ནའི་ཀུན་ཏུ་རྒྱུ་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པ།
en: He thought, “The mendicants of old are aged and infirm now.

source: སྡེ་ཚན་གྱི་སློབ་དཔོན་ཆེན་པོ་དག་ལས་བདག་གིས་ཐོས་ནདེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ནི་བརྒྱ་ལམ་ན་འབྱུང་བར་ཟད་དོ་ཞེས་ཟེར་བ་ལས་ན།
en: It was from the great masters of their school that I heard that tathāgatas, arhats, totally and completely awakened buddhas, universal monarchs, and udumbara flowers arise but rarely.

source: ཨུ་དུམ་བཱ་རའི་ཚལ་འདིར་ཡང་བདག་གི་བསོད་ནམས་ཀྱིས་ཨུ་དུམ་བཱ་ར་རྣམས་ཀྱི་མེ་ཏོག་ཁ་འབུས་པར་གྱུར་ཏོ་སྙམ་མོ། །
en: It is on account of my merit that the udumbara flowers in the udumbara forest are blooming.”

source: དེར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྒན་པོ་དང་། ནད་པ་དང་། ཤི་བ་གཟིགས་ནས་ནགས་ཁྲོད་དུ་གནས་བཅས་པ་དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་ལ་སྨྲས་པ།
en: When the Bodhisattva witnessed old age, sickness, and death and went to live in the charnel grounds, Śakra, king of the gods, said to the gandharva king Supriya,

source: རབ་དགའ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་རྒན་པོ་དང་། ནད་པ་དང་། ཤི་བ་གཟིགས་ནས་ནགས་ཁྲོད་དུ་གནས་བཅས་ཀྱིས།
en: “Supriya, the Bodhisattva has witnessed old age, sickness, and death, and has gone to live in the forest.

source: བདག་ཅག་དོང་ལ་དེའི་མཆོད་པའི་ལས་ལ་བརྩོན་པར་བྱའོ། །
en: Let us make an effort to offer him our adoration.”

source: རབ་དགས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བདག་གིས་གླུ་དབྱངས་སྦྱར་བ་བརྩམས་ལགས་ཏེ། དེ་རེ་ཞིག་ལགས་པར་བགྱིས་ནས་སླད་ཀྱིས་སླེབས་སོ་ཞེས་ཟེར་རོ། །
en: “Kauśika,” Supriya told him, “I have just begun composing a song, but once it is finished, I shall go.”

source: དེར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས་ལན་གསུམ་དུ་བཟླས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་ཆོས་བཞིན་དུ་བསྐོར་བ་དེའི་ཚེ་བརྒྱ་བྱིན་གྱིས་ཡང་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་ལ་སྨྲས་པ།
en: When the Bodhisattva achieved unexcelled wisdom, he enumerated the four truths of noble beings three times over, setting in proper motion the Dharma wheel in its twelve aspects, and Śakra said again to the gandharva king Supriya,

source: རབ་དགའ་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས་ལན་གསུམ་དུ་བཟླས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་བསྐོར་བར་བཞེད་ཀྱིས་ཚུར་བདག་ཅག་སོང་ལ་ཆོས་མཉན་པར་བྱའོ། །
en: “Supriya, the Blessed One has achieved unexcelled enlightenment, enumerated the four truths of noble beings three times over, and set the Dharma wheel in its twelve aspects in proper motion. Let us go to listen to the Dharma.”

source: རབ་དགས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བདག་གིས་གླུ་དབྱངས་སྔར་བརྩམས་ལགས་ཏེ། རེ་ཞིག་དེ་ལགས་པར་བགྱིས་ནས་སླད་ཀྱིས་སླེབས་སོ་ཞེས་ཟེར་རོ། །
en: “Kauśika,” Supriya told him, “I have just begun composing a song, but once it is finished, I shall go.”

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལན་གསུམ་དུ་བཟླས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་བསྐོར་བ་དེའི་ཚེ་ཨུ་དུམ་བཱ་རའི་ཚལ་དེ་དག་རྣམ་པ་ཐམས་ཅད་དུ་མེ་ཏོག་རྒྱས་པར་གྱུར་ཏེ
en: When the Blessed One enumerated the four truths of noble beings three times over and set the Dharma wheel in its twelve aspects in proper motion, all the flowers in the udumbara forest began to bloom,

source: དེས་ན་དཔག་ཚད་མང་པོར་དྲི་བསུང་གིས་རྒྱས་པར་གྱུར་ཏེ།
en: and their fragrance spread for many leagues.

source: རྒྱུ་དེས་ན་ཀུན་དུ་རྒྱུ་རབ་བཟང་ལྷག་པར་ཡང་ཡིད་དགའ་བར་གྱུར་ནས་འདི་དག་ནི་བདག་གི་བསོད་ནམས་ལས་གྱུར་པ་ཡིན་ནོ་སྙམ་མོ། །
en: This caused the mendicant Subhadra particular delight, and he thought, “It is on account of my merit that all this has happened.”

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལན་གསུམ་དུ་བཟླས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་ཆོས་བཞིན་དུ་བསྐོར་བ་དེའི་ཚེ་ལྔ་སྡེ་དང་། ཉེ་བའི་ལྔ་སྡེ་རྣམས་དང་། གྲོང་གི་བྱིས་པ་མགོ་མཐོ་མཐོ་ལྔ་བཅུ་བཏུལ་ཏོ། །
en: When the Blessed One enumerated the four truths of noble beings three times over and set the Dharma wheel in its twelve aspects in proper motion, he also tamed the group of five friends, the group of five close friends, and the group of fifty of the city’s young elite.

source: ཤིང་བལ་གྱི་ཤིང་གི་ནགས་ཁྲོད་དུ་གཤེགས་ནས་བཟང་སྡེ་དྲུག་ཅུའི་ཕ་ཚན་བདེན་པ་རྣམས་ལ་བཀོད་དོ། །
en: When he traveled to the cottonwood forest he established sixty of his paternal relatives in the truths.

source: སྡེ་པའི་གྲོང་དུ་གཤེགས་ནས་གྲོང་ན་གནས་པའི་བུ་མོ་དགའ་མ་དང་། དགའ་སྟོབས་མ་གཉིས་བདེན་པ་རྣམས་ལ་བཀོད་དོ། །
en: When he traveled to the village of Serika he established young Nandā and Nandabalā, who lived there in that village, in the truths.

source: ལྟེང་རྒྱས་སུ་གཤེགས་ནས་རལ་པ་ཅན་སྟོང་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་དོ། །
en: When he traveled to Uruvilvā he led the one thousand longhaired ascetics to go forth as novices and then conferred on them full ordination.

source: ག་ཡཱའི་རྩེ་མོའི་མཆོད་རྟེན་གྱི་དྲུང་དུ་གཤེགས་ནས་དགེ་སློང་སྟོང་པོ་དེ་དག་ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་གྱིས་ཡིད་ཆེས་པར་མཛད་དེ་གཡུང་དྲུང་གི་མཐར་ཐུག་པ། བླ་ན་མེད་པའི་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: When he traveled to the stūpa at Gayāśīrṣa he won the trust of thousands of monks with three miraculous transformations, and established them in the unsurpassed, supreme welfare of nirvāṇa.

source: སྨྱིག་མའི་ནགས་ཁྲོད་དུ་གཤེགས་ནས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ལྷ་བརྒྱད་ཁྲི་དང་། ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་འབུམ་ཕྲག་དུ་མ་དང་ཐབས་ཅིག་ཏུ་བདེན་པ་རྣམས་ལ་གནས་པར་མཛད་དོ། །
en: When he traveled to the Forest of Reeds he established Śreṇiya Bimbisāra, King of Magadha, along with eighty thousand gods and hundreds upon hundreds of thousands of the householders of Magadha, in the truths.

source: རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་ནས་འོད་མའི་ཚལ་བཞེས་ཏེ། ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཡོག་འཁོར་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་ལྡན་པ་གཉིས་རབ་ཏུ་ཕྱུང་ནས་བསྙེན་པར་རྫོགས་པར་མཛད་དོ། །
en: When he traveled to Rājagṛha he accepted the gift of Bamboo Grove, led Śāriputra, Maudgalyāyana, and their suites of two hundred and fifty attendants to go forth as novices, and then conferred on them full ordination.

source: མཉན་དུ་ཡོད་པར་གཤེགས་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་བཞེས་ཏེ་
en: When he traveled to Śrāvastī he accepted the gift of the garden of Prince Jeta,

source: ཆོ་འཕྲུལ་ཆེན་པོ་བསྟན་ནས་
en: made a great display of miracles,

source: དགེ་ཚུལ་སྐུལ་བྱེད་རབ་ཏུ་ཕྱུང་སྟེ་
en: and led Cunda to go forth as a novice,

source: དེས་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་
en: who then cast away all afflictive emotions

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ
en: and manifested arhatship.

source: དེ་རྫུ་འཕྲུལ་གྱིས་འགྲོ་ཞིང་གནས་གཞན་དང་གཞན་དག་ནས་དུས་མ་ཡིན་པའི་མེ་ཏོག་དང་འབྲས་བུ་རྣམས་བླངས་ཤིང་མཁན་པོ་དང་དགེ་འདུན་ལ་འབུལ་བར་བྱེད་དོ། །
en: After that, Cunda used his miraculous powers as a means of travel and, traveling from place to place, would scoop flowers and fruits onto large leaves, carry them from one place to another, and bring them as offerings to his preceptor and to the saṅgha.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་མཚོ་མ་དྲོས་པའི་འགྲམ་དུ་སོང་ནས་དེ་དེར་དགའ་བར་གྱུར་ཏེ།
en: So it was that one day he traveled to the banks of Lake Anavatapta.

source: དེས་དེར་ཉིན་བར་གྱི་གནས་བཏབ་པ་ལས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་གིས་སྨྲས་པ།
en: He was very happy to be there and stayed the whole day until the mendicant Subhadra said,

source: གྲོགས་པོ་འདི་ནི་ངའི་ཉིན་བར་གྱི་གནས་ཡིན་གྱིས་འདིར་མ་འདུག་ཤིག །
en: “My friend, this is where I spend the day. Please don’t stay here.”

source: དགེ་ཚུལ་སྐུལ་བྱེད་ཀྱིས་སྨྲས་པ། འདི་ནི་ཐམས་ཅད་ཀྱི་ཐུན་མོང་ཡིན་ནོ། །
en: “This place is open to everyone,” the novice Cunda replied.

source: ཀུན་ཏུ་རྒྱུ་རབ་བཟང་གིས་སྨྲས་པ། ང་དང་རྫུ་འཕྲུལ་གྱིས་འགྲན་པར་གྱིས་ཤིག་དང་།
en: “Let us have a contest of miracles,” proposed the mendicant Subhadra said.

source: དེ་ནས་འདི་འོ་བུ་ཅག་གཉིས་གང་རྒྱལ་བ་དེའི་ཉིན་བར་གྱི་གནས་སུ་བྱའོ་ཞེས་བྱས་ནས་
en: “Whoever wins can spend the day here.”

source: དེ་གཉིས་རྫུ་འཕྲུལ་སྟོན་པ་ལ་ཞུགས་པ་ལས་དེར་དགེ་ཚུལ་སྐུལ་བྱེད་ཀྱིས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ཕམ་པར་བྱས་ནས་
en: The two began their competition in the display of miracles, and the novice Cunda defeated the mendicant Subhadra,

source: དེ་ཡུལ་ཡུལ་པོར་གྱུར་ཏེཨུ་དུམ་བཱ་རའི་ཚལ་དེ་ཉིད་དུ་སོང་ནས་འདུག་གོ། །
en: who, quite chagrined, went back to dwelling in the udumbara forest.

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས་ཀུ་ཤའི་གྲོང་ཁྱེར་དུ་གཤེགས་ཏེ། གཟིམས་མལ་གྱི་ཐ་མར་ཞུགས་ནས་བཞུགས་སོ། །
en: When the Blessed One had carried out all the activities of a buddha, he traveled to the city of Kuśinagarī, where he took to his final bed.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: The Blessed One thought,

source: ད་ནི་དེ་བཞིན་གཤེགས་པས་གདུལ་བར་བྱ་བ་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་དང་། དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་གཉིས་ལུས་སོ་སྙམ་དུ་དགོངས་སོ། །
en: “Now there are two disciples that the Tathāgata should tame—the mendicant Subhadra, and the gandharva king Supriya.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: The Blessed One also thought,

source: ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ངས་གདུལ་བར་སླ་ན་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་ནི་རྒྱགས་ཤིང་བག་མེད་པར་གནས་ཏེ་
en: “I can easily tame the mendicant Subhadra, but since the gandharva king Supriya is arrogant and aloof,

source: དེ་ངའི་ཐད་དུ་མི་འོང་གིས། ང་ཉིད་དེའི་ཐད་དུ་འགྲོའོ་སྙམ་དུ་དགོངས་ཏེ
en: he will not come to see me, so I will go to him.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེར་སྤྲུལ་པ་ཞིག་བཞག་ནས་ཤིང་ས་ལ་ཟུང་གི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: The Blessed One left behind an emanation, disappeared from the copse of two śāla trees,

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་གཤེགས་ནས་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའི་ཕོ་བྲང་གི་སྒོར་བྱོན་ཏེ།
en: and traveled to the Heaven of the Thirty-Three where he arrived at the gates of the palace of the gandharva king Supriya.

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: The Blessed One thought,

source: འདིའི་ང་རྒྱལ་བཅག་ནས་གདོད་དེའི་འོག་ཏུ་བདེན་པ་རྣམས་ཀྱི་སྣོད་དུ་རུང་ངོ་སྙམ་དུ་དགོངས་ཏེ།
en: “After I shatter his ego, he will become a vessel for the truths.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གདུལ་བའི་ཕྱིར་དྲི་ཟའི་རྒྱལ་པོ་ཞིག་ཏུ་སྤྲུལ་ནས་བཻ་དཱུརྱའི་པི་བང་རྒྱུད་སྟོང་པ་ཞིག་བསྣམས་ཏེ། དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའི་སྒོ་དྲུང་དུ་གཞེས་ནས་ཕྲིན་གྱིས་བཟླུགས་ཏེ་དྲི་ཟའི་རྒྱལ་པོ་ཞིག་སྒོ་ན་སྡོད་དེ།
en: Then, to tame him, the Blessed One magically manifested himself as a gandharva king bearing a lute with a hundred thousand strings of blue beryl, went up to the gate of the gandharva king Supriya, and sent a message, saying, “A gandharva king stands at the gates.

source: དེ་ཁྱོད་དང་ལྷན་ཅིག་ཏུ་པི་བང་ལེན་པར་འདོད་དོ་ཞེས་བྱས་སོ། །
en: He wishes to play the lute with you.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགས་བསམས་པ།
en: As soon as he heard this, the gandharva king Supriya thought,

source: མ་ལ་དྲི་ཟའི་རྒྱལ་པོ་གཞན་འགའ་ཞིག་མ་བྱུང་གྲང་། དེ་ནི་བདག་གིས་ཚར་གཅད་པར་བྱའོ་
en: “What? There can’t be another gandharva king! I shall eliminate him.”

source: སྙམ་དུ་བསམས་ནས་སྨྲས་པ།
en: With this thought, he said,

source: ནང་དུ་བོས་ཤིག་དང་བདག་གིས་ཅི་ནུས་པ་བསྟན་ཏོ་ཞེས་བྱས་ཏེ་
en: “Call him inside! I will show him what I can do.”

source: དེས་དེ་ནང་དུ་བོས་ནས་པི་བང་ལེན་པ་ལ་ཞུགས་སོ། །
en: Once he had been invited inside they began to play their lutes together.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གདུལ་བའི་ཕྱིར་པི་བང་གི་རྒྱུད་གཅིག་བཅད་པ་དང་།
en: Then, to tame him, the Blessed One cut a single string from his own lute.

source: དྲི་ཟའི་རྒྱལ་པོ་རབ་དགས་ཀྱང་དེ་མཐོང་ནས་ཀྱང་རྒྱུད་གཅིག་བཅད་དོ། །
en: The gandharva king Supriya, noticing this, cut one string from his lute as well.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཐར་གྱིས་རྒྱུད་ཐམས་ཅད་བཅད་དེ་རྒྱུད་གཅིག་པུ་ལུས་པར་གྱུར་ནས་དེ་ལས་ཀྱང་སྒྲ་ཐམས་ཅད་འབྱུང་བར་མཛད་དོ། །
en: Then the Blessed One gradually cut all the strings from his lute, until only one remained, from which every note continued to sound.

source: དེ་ནས་རབ་དགས་ཀྱང་རྒྱུད་ཐམས་ཅད་བཅད་དེ་དེས་ཀྱང་རྒྱུད་གཅིག་པུ་དེ་ལས་སྒྲ་ཐམས་ཅད་འབྱུང་བར་བྱས་སོ། །
en: So Supriya also cut away all his strings, and likewise made every note sound from a single string.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱུད་གཅིག་པུ་དེ་ཡང་བཅད་དེ་སྒྲ་ཐམས་ཅད་ཀྱང་འབྱུང་བར་མཛད་དོ། །
en: Then the Blessed One cut even that lone remaining string, yet every note continued to sound.

source: དེ་ནས་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགས་བསམས་པ།
en: The gandharva king Supriya thought,

source: བདག་གིས་ནི་དེ་ལས་ལྷག་པར་ཆུང་ཟད་ཀྱང་བསྟན་པར་མི་ནུས་པས་ན།
en: “I cannot do any more than this.

source: འདི་ནི་བདག་པས་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་ཞིག་གོ་སྙམ་མོ། །
en: So be it—he is far better than I.”

source: དེ་ནས་དེའི་སྐབས་སུ་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། འདི་ང་རྒྱལ་ང་དང་མཚུངས་པ་སུ་ཡང་མེད་དོ་སྙམ་དུ་དེ་ལྟར་འཛིན་པ་དེ་མེད་པར་གྱུར་ཏོ་སྙམ་དུ་ཐུགས་སུ་ཆུད་དེ
en: The Blessed One directly apprehended that Supriya’s arrogance was gone, and that he no longer thought, “There is no one like me!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ང་རྒྱལ་བཅག་ནས་རང་བཞིན་གྱི་སྐུར་བསྒྱུར་ཏོ། །
en: Having thus shattered Supriya’s ego, the Blessed One assumed his natural form.

source: དེ་ནས་དེས་བཅོམ་ལྡན་འདས་མཐོང་ནས་དེ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་ཏེ་དགའ་བར་གྱུར་ནས།
en: When he saw the Blessed One, Supriya experienced a surge of joy.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: In his joy he bowed down at the Blessed One’s feet and sat before him to listen to the Dharma.

source: དེས་ན་དྲི་ཟའི་རྒྱལ་པོ་རབ་དགའ་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: When he heard it, the gandharva king Supriya destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་ནས་མི་སྣང་བར་གྱུར་ཏོ། །
en: After the Blessed One disappeared from among the gods of the Heaven of the Thirty-Three,

source: དེའི་ཚེ་ཨུ་དུམ་བཱ་རའི་ཚལ་དེའི་མེ་ཏོག་རྣམས་རྙིས་པར་གྱུར་ཏེ།
en: the flowers of the udumbara forest began to fade.

source: ཀུན་ཏུ་རྒྱུ་རབ་བཟང་གིས་ཨུ་དུམ་བཱ་རའི་ཚལ་དེའི་མེ་ཏོག་རྣམས་རྙིས་པར་གྱུར་པ་མཐོང་ངོ་། །
en: The mendicant Subhadra saw that the flowers of the udumbara forest were fading, and great sorrow arose in him.

source: མཐོང་ནས་ཀྱང་དེ་མྱ་ངན་ཆེན་པོ་སྐྱེས་ཏེ་
en: [The mendicant Subhadra saw that the flowers of the udumbara forest were fading,] and great sorrow arose in him.

source: བདག་གི་བསོད་ནམས་ཀྱིས་ཨུ་དུམ་བཱ་རའི་ཚལ་འདི་རྣམ་པ་ཐམས་ཅད་དུ་མེ་ཏོག་རྒྱས་པར་གྱུར་པ་ལས།
en: “It is on account of my merit that flowers bloomed throughout the udumbara forest,

source: ད་ནི་བདག་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པར་གྱུར་ཏེན་ཚོད་ལོ་བརྒྱ་ཉི་ཤུ་ལོན་ན་ཨུ་དུམ་བཱ་རའི་ཚལ་གྱི་མེ་ཏོག་འདི་དག་རྙིས་པར་གྱུར་པ་ལས་ན།
en: but now that I am old and infirm, 120 years of age, the flowers of the udumbara forest are fading.

source: བདག་རིང་པོ་མི་ཐོགས་པར་འཆི་བར་འགྱུར་རོ་སྙམ་ནས་རྒྱུ་དེས་ན་ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་སྡུག་བསྔལ་ལ་སྨྲེ་སྔགས་འདོན་པར་བྱེད་དོ། །
en: It is certain, then—I shall die before long.” At this the mendicant began to grieve and suffer greatly, wailing and lamenting.

source: དེ་ནས་དེ་ལ་དགའ་བའི་ལྷ་ཞིག་གིས་རབ་བཟང་ལ་སྨྲས་པ།
en: Thereupon a god who was fond of Subhadra said to him,
